{
  "entry": [
    {
      "id": "E1",
      "question": "Are you a Vaiṣṇava? If not, which sampradāya or tradition do you follow?"
    },
    {
      "id": "E2",
      "question": "What are your views on the Vaiṣṇava ācāryas and their teachings?"
    },
    {
      "id": "E3",
      "question": "How did you find this server, and what attracted you to join?"
    },
    {
      "id": "E4",
      "question": "What brings you to this Krishna-conscious community? (Learning, association, service, etc.)"
    },
    {
      "id": "E5",
      "question": "Will you follow the rules and maintain respectful behavior in this server?"
    },
    {
      "id": "E6",
      "question": "Are you formally initiated into any sampradāya or following a particular guru?"
    }
  ],
  "reflective": [
    {
      "id": "R1",
      "question": "What inspires you most about Krishna-bhakti or the life of a devotee?"
    },
    {
      "id": "R2",
      "question": "If Krishna appeared before you now, what would you ask or say to Him?"
    },
    {
      "id": "R3",
      "question": "Have you ever felt a personal or emotional connection to Krishna or the divine?"
    },
    {
      "id": "R4",
      "question": "Which spiritual quality (like humility, patience, compassion) would you most like to develop?"
    }
  ],
  "psychological": {
    "trusted": [
      {
        "id": "P1",
        "question": "What does humility mean to you in the context of spiritual life?"
      },
      {
        "id": "P2",
        "question": "If someone gently questioned your beliefs, how would you respond?"
      }
    ],
    "medium": [
      {
        "id": "P3",
        "question": "How would you handle it if someone mocked your beliefs online?"
      },
      {
        "id": "P4",
        "question": "If someone mocked Krishna or bhakti near you, what would you feel or do?"
      }
    ],
    "high": [
      {
        "id": "P5",
        "question": "What would you do if a devotee corrected you firmly on a topic?"
      },
      {
        "id": "P6",
        "question": "If told your views don't align with the bhakti philosophy here, how would you respond?"
      }
    ]
  }
}
